#include <stdio.h>

/*int main()
{
	int num = 2;
	unsigned int num1 = 0;
	printf("%d\n", ~num);
	printf("%u", ~num1);
	return 0;
}
*/
/*负数：原码等于补码减一取反（符号位不变）
	 ~(2)=> ~(00000000 00000000 00000000 00000010)
	     =>   11111111 11111111 11111111 11111101 (取反)
		 =>   11111111 11111111 11111111 11111100 (减一）
		 =>   10000000 00000000 00000000 00000011 (取反，符号位不变）
	 ~（-1）
	 原码：10000000 00000000 00000000 00000001
	 反码：11111111 11111111 11111111 11111110  （原码+1）
	 补码：11111111 11111111 11111111 11111111   (按位取反，符号不变）
	 取反：00000000 00000000 00000000 00000000   (补码取反）
*/
/*
1、所有正整数的按位取反是其本身+1的负数；

2、所有负整数的按位取反是其本身+1的绝对值；

3、零的按位取反是-1（0在数学界既不是正数也不是负数）；
*/